{
  "_name_or_path": "neuralmind/bert-base-portuguese-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "OU",
    "1": "OO",
    "2": ".O",
    "3": "!O",
    "4": ",O",
    "5": ".U",
    "6": "!U",
    "7": ",U",
    "8": ":O",
    "9": ";O",
    "10": ":U",
    "11": "'O",
    "12": "-O",
    "13": "?O",
    "14": "?U"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "!O": 3,
    "!U": 6,
    "'O": 11,
    ",O": 4,
    ",U": 7,
    "-O": 12,
    ".O": 2,
    ".U": 5,
    ":O": 8,
    ":U": 10,
    ";O": 9,
    "?O": 13,
    "?U": 14,
    "OO": 1,
    "OU": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.20.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
